
# 파이썬 만 해당하는 객체지향 이야기?

##################

# 파이썬의 특징
#   - 효율적인 프로그램 =>> 사람 친화적 
#   - 자유로운 -> 혼란
#   - 개발자들이 많음 -> 만든거를 공유하는 문화
#       - 남의거 잘 갖다 쓰자
#       - 이름 중복디 이 빈번할텐데 구분할 수단이 필요하겠지
#       ->> Package " 패키지 명도 중복되면? 망함
#           그래도 Python은 자유롭게 패키지명을 씀

##################
 
# package (선택사항) - moduel(.py 필수사항) - class (선택사항)
# OOP의 권장사항 : 1file에 1class인데, Python은 무관심.
# package써가면서 module로 좀 나누자

# package : VScode에서는 폴더로 만들고
#   무조건 __init__.py 파일이 필요함 (VScode에서는 직접 만들어야.)

# import
#   선택사항 : 안해도 되는데, import 하면 문법이 간단해짐
#   필수사항 : (python은 여기에 해당)
# python은 다른 모듈(파일)에 있는거 불러오려면 무조건 해야하는거 (=Import)

