
# MVC패턴
# C는 많아질테고
# 프로그램의 첫 진입점 역할하는 C
#       HomeController, MainController
##############################
# V는 파이썬의 콘솔창.
# 앞으로는 V가 웹사이트, 스마트폰 앱 화면, ...
#   딱히 바꿀 이름은 ...
##############################
# M은 자유롭게 이름

##############################
##############################
# DAO/DTO 패턴
#   기본 베이스는 MVC패턴
#   M중에 DB관련 작업하는 애 : DAO(Data Access Object)
#   M-V-C간에 전달? 작업 관련되는 데이터 : DTO(Data Transfer Object) 

##############################
##############################
# AOP 패턴
#   DB 작업때마다, 연결/cur 만들고, 닫고는 늘 해야하는 작업
#   => 



##############################

# 서버에서 실행할거, -> 프로젝트 단위로 보내서 실행
# 다른 프로젝트에 있는거 실행하려면, -> PythonPath ??
# => 이거는 철저히 윈도우 환경만 가능
# 
# 


# Apr07_2_Python : 사실은 폴더지만, 프로젝트 취급
# 모든 파일은 그 프로젝트 폴더 안에 다 넣고 진행
# __Pycache__
# __init__.py : 패키지에 무조건 있어야 하는 파일.

# cache메모리? : 매번 HDD에서 가져오면 속도가 느림
#   자주 사용된다 싶은거를 따로 저장해서 다음에 빨리 불러지게 하는거.
#
#   자주 사용되는 것들을 CPU에 넣어놓으면 -> 빠르겠지?
#   CPU는 속도의 장치
#   HDD는 용량의 장치

