
# Go 언어
# 빅데이터 분석 및 처리 관련

# 다른 일반적인 프로그래밍 언어
# => 컴파일러 Compiler 방식
# => 프로그램 소스 전체를 한방에 기계어로 번역
# 최종 산출물 파일이 따로 생성
# - 설계 > 소스 > 전기흐름(실행파일) > 실행 
# 띄어쓰기, 엔터는 아무 의미 없음

# Python 언어
# 프로그래밍 언어 - 고오급 언어 (개발자가 직접 컨트롤 하지 않아도 자동으로 처리해주는게 많음) 
# = 사람 친화적 
# = 효율성은 떨어짐
# 일반적인 프로그래밍 언어들과 차이점?이 있음
# => 인터프리터 Interpreter 방식
# => 프로그램 소스 한줄씩 기계어로 번역해서 실행, 다음줄 번역해서 실행...
# =>> 대화식 처리 가능 (한줄써서 실행해보고, 다음줄 써서 실행해보고..)
# =>> jupyter notebook 같은게 가능
# 소스 자체가 최종 산출물
# - 설계 > 소스 > 기계어 > 전기 흐름 > 실행 

# Encoding 인코딩 : 데이터를 전기의 흐름으로 바꾸는 것
# Decoding 디코딩 : 전기의 흐름 상태인 것을 데이터로 바꾸는 것

# 프로그램 소스 코드(인간의 언어) => 컴파일-기계어 변환 => 인코딩-101001

# ctrl + F5 >> 실행
# ctrl + shift + f >> 소스 정렬
# ctrl + / >> 주석
# alt + 화살표위/아래 >> 소수 이동
# alt + shift + 화살표위/아래 >> 줄 복사
# ctrl + shift + k >> 줄 삭제
# ctrl + space >> 소스 자동완성


# zip, 압축
# 쓸데없는 공백 지우기

print("ASD");
